# Brewfile — Homebrew tools, apps, and fonts.
# Install everything at once with:  brew bundle --file ~/.dotfiles/Brewfile
# Lists only top-level installs (`brew leaves`), not their dependencies.

# CLI tools
brew "stow"     # symlink manager that wires these packages into $HOME
brew "git"
brew "tmux"
brew "neovim"
brew "gh"       # GitHub CLI
brew "docker"   # docker CLI
brew "httpie"   # human-friendly HTTP client
brew "uv"       # Python package / project manager

# Applications
cask "iterm2"
cask "visual-studio-code"
cask "brave-browser"
cask "claude"
cask "claude-code@latest"
cask "docker-desktop"
cask "linearmouse"
cask "obsidian"
cask "spotify"

# Fonts — Nerd Font supplies the glyphs used by Powerlevel10k, LazyVim and the
# tmux status bar. Without it those icons render as "?" or boxes.
# After installing, set your terminal font to "MesloLGS Nerd Font Mono".
cask "font-meslo-lg-nerd-font"
